Управление_по_целям_и_KPI/src/InformationRegisters/KPI_Анализ/KPI_Анализ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_Анализ</name>
  <resources>
    <name>Анализ</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Корректировка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.KPI_Планирование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦелевойПоказатель</name>
    <type>
      <types>CatalogRef.KPI_ЦелевыеПоказатели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.KPI_КлючиАналитики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/Documents/KPI_СмартЗадача/KPI_СмартЗадача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_СмартЗадача</name>
  <basedOn>Document.KPI_СмартЗадача</basedOn>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.KPI_Планы</registerRecords>
  <registerRecords>AccumulationRegister.KPI_Факты</registerRecords>
  <registerRecords>InformationRegister.KPI_ИсторияСмартЗадач</registerRecords>
  <attributes>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураКомпанииПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнитьДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.KPI_ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Факт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КритерийВыполнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Утверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСмартЗадач</name>
    <type>
      <types>CatalogRef.KPI_ГруппыСмартЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.KPI_СмартЗадача</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСвязи</name>
    <type>
      <types>EnumRef.KPI_ВидыСвязиСмартЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.KPI_Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>CatalogRef.KPI_Этапы</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторУтверждения</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторПроверки</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Делегирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_Анализ/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ВвестиСЗ(Команда)
	
	ФормаСмартЗадачи = ПолучитьФорму("Документ.KPI_СмартЗадача.ФормаОбъекта");
	ДанныеФормы = ФормаСмартЗадачи.Объект;
	ЗаполнитьНаСервереФормуСЗ(ДанныеФормы, Запись.Корректировка, Параметры.ДатаДок, Параметры.Периодичность, Параметры.Сотрудник);
	КопироватьДанныеФормы(ДанныеФормы, ФормаСмартЗадачи.Объект);
	ФормаСмартЗадачи.ОткрытьМодально();
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервереФормуСЗ(НовыйОбъект, НаименованиеЗадачи, ДатаДок, Периодичность, Сотрудник)
	
	НовыйОбъект.НаименованиеЗадачи        = НаименованиеЗадачи;
	НовыйОбъект.Дата                      = ДатаДок;
	НовыйОбъект.ПериодичностьПланирования = Периодичность;
	НовыйОбъект.Сотрудник                 = Сотрудник;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Запись.Основание             = Параметры.Основание;
	Запись.ЦелевойПоказатель     = Параметры.ЦелевойПоказатель;
	Запись.КлючАналитики         = Параметры.КлючАналитики;	
	Параметры.Модифицированность = ЭтаФорма.Модифицированность;
	
КонецПроцедуры
